


Network Working Group                                       K. Chowdhury
Internet-Draft                                          Starent Networks
Expires: November 17, 2005                                     P. Yegani
                                                           Cisco Systems
                                                               L. Madour
                                                                Ericsson
                                                            May 16, 2005


        DHCP Options for Broadcast and Multicast Control Servers
                   draft-ietf-dhc-bcmc-options-01.txt

Status of this Memo

   By submitting this Internet-Draft, each author represents that any
   applicable patent or other IPR claims of which he or she is aware
   have been or will be disclosed, and any of which he or she becomes
   aware will be disclosed, in accordance with Section 6 of BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups.  Note that
   other groups may also distribute working documents as Internet-
   Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/ietf/1id-abstracts.txt.

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html.

   This Internet-Draft will expire on November 17, 2005.

Copyright Notice

   Copyright (C) The Internet Society (2005).

Abstract

   This document defines new options for Broadcast and Multicast Service
   controller discovery in an IP network.  Broadcast service is being
   developed for 3rd generation (3G) cellular telephone networks.  Users
   of the service interact with a controller in the network via the
   Mobile Node (MN) to derive information required to receive broadcast



Chowdhury, et al.       Expires November 17, 2005               [Page 1]

Internet-Draft                                                  May 2005


   service.  Dynamic Host Configuration Protocol can be used to
   configure the MN to acccess a particular controller.  This document
   defines the related options and option codes.

Table of Contents

   1.  Motivation . . . . . . . . . . . . . . . . . . . . . . . . . .  3
   2.  Overview of the 3GPP2 BCMCS Network  . . . . . . . . . . . . .  4
   3.  Terminology  . . . . . . . . . . . . . . . . . . . . . . . . .  5
   4.  Broadcast Service Controller Options . . . . . . . . . . . . .  6
     4.1   Broadcast Service Controller Domain Name list  . . . . . .  6
     4.2   Broadcast Service Controller Domain Name List Option
           for DHCPv6 . . . . . . . . . . . . . . . . . . . . . . . .  7
     4.3   Broadcast Service Controller IPv4 address option . . . . .  8
     4.4   Broadcast Service Controller IPv6 Address Option . . . . .  8
     4.5   Consideration for Client Operation . . . . . . . . . . . .  9
     4.6   Consideration for Server Operation . . . . . . . . . . . .  9
   5.  Security Considerations  . . . . . . . . . . . . . . . . . . . 10
   6.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . . 11
   7.  Acknowledgements . . . . . . . . . . . . . . . . . . . . . . . 12
   8.  Normative References . . . . . . . . . . . . . . . . . . . . . 12
       Authors' Addresses . . . . . . . . . . . . . . . . . . . . . . 12
       Intellectual Property and Copyright Statements . . . . . . . . 14




























Chowdhury, et al.       Expires November 17, 2005               [Page 2]

Internet-Draft                                                  May 2005


1.  Motivation

   Dynamic Host Configuration Protocol [RFC2131] and [RFC3315] can be
   used to configure various non-IP address type of parameters.  These
   parameters are required for normal operation of various services that
   are offered over an IP network.

   Broadcast and multicast service (BCMCS) is one such service that is
   currently being standardized in various mobile wireless standard
   bodies such as 3GPP, 3GPP2 and OMA.  A description of the BCMCS, for
   example, in 3GPP2 can be found in [BCMCS].

   While DHCP offers necessary mechanisms for device configuration, it
   lacks the information elements required to configure a mobile device
   to support BCMCS.  This memo defines the extensions needed for DHCP
   to provide necessary configuration information to a mobile device in
   a BCMCS network.

   DHCP is being used in 3GPP2, for example, to assist with the
   discovery of the BCMCS Controller in a mobile operator's IP network.
   The BCMCS includes a controller component that is responsible for
   managing the service via interaction with the MN and other network
   entities.

   An overview of the 3GPP2 BCMCS architecture is given in the next
   section.  It provides enough information to understand the basics of
   the 3GPP2 BCMCS operation.  Readers are encouraged to find a more
   detailed description in [BCMCS].

   As described in [BCMCS], the MNs are required to know the IPv4 or the
   IPv6 address of the controller entity so that they can download all
   the necessary information about a desired broadcast program.  In a
   roaming environment static configuration of the controller's IP
   address becomes unrealistic.  Therefore, DHCP is considered to be a
   method to dynamically configure the MNs with the IP address or the
   fully qualified domain name of the controller in the 3G cellular
   telephone networks.

   In order to allow the MNs to discover the broadcast controllers, the
   DHCP clients request for appropriate option codes from the DHCP
   server using Parameter Request List option.  The DHCP servers need to
   return the corresponding configuration options that carry either
   broadcast and multicast service controller's IP address or fully
   qualified domain name based on configuration.  This document defines
   the necessary options and option codes.






Chowdhury, et al.       Expires November 17, 2005               [Page 3]

Internet-Draft                                                  May 2005


2.  Overview of the 3GPP2 BCMCS Network

   The Broadcast and Multicast Service architecture in a 3G cellular
   telephone network such as 3GPP2 has the following model:



                              +------------+   +--------+
                              |            |   |        |
                              | Controller |   |  DHCP  |
                              |            |   | Server |
                              +------------+   +--------+
                                     ^
                              Control|
                                 Info|
                                     |
                                     |
                                     V
   +----+        +------------+    +------------+
   |    |        |            |    |            |
   | MN/| bearer |   Radio    |    | Broadcast  |
   |User|<-------|   Access   |<---| Content    |
   |    |        |   Network  |    | Server     |
   +----+        +------------+    +------------+


   Note that this figure is shown here for broad understanding of how
   Broadcast and Multicast service works in a 3G cellular telehone
   network.  The network elements except MN/user and the DHCP server are
   not relevant to the text in this document.

   The MN interacts with the Controller to request broadcast/multicast
   program information from the network (e.g., scheduled time, multicast
   IP address, port numbers).  The MN may also be authenticated by the
   Controller while downloading the relevant program security related
   information (such as encryption key).  These interactions may happen
   via HTTP and XML.  There may be more than one controller in the
   network.  The MN should discover the appropriate controller to
   request the relevant program information.  For details of Broadcast
   and Multicast Service operation in 3GPP2, see [BCMCS]











Chowdhury, et al.       Expires November 17, 2005               [Page 4]

Internet-Draft                                                  May 2005


3.  Terminology

   The keywords "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD",  "SHOULD  NOT",  "RECOMMENDED",  "MAY",  and "OPTIONAL" in
   this document are to be interpreted as described in RFC 2119.














































Chowdhury, et al.       Expires November 17, 2005               [Page 5]

Internet-Draft                                                  May 2005


4.  Broadcast Service Controller Options

   This section defines the configuration option for the controller of
   the broadcast service.

4.1  Broadcast Service Controller Domain Name list

   If the 'enc' byte has a value of 0, the encoding byte is followed by
   a sequence of labels, encoded according to Section 3.1 of RFC 1035
   [RFC1035].

   The option MAY contain multiple domain names, but these domain names
   SHOULD be used to construct SRV lookups as specified in [BCMCS],
   rather than querying for different A records.  The client MUST try
   the records in the order listed, applying the mechanism described in
   [BCMCS] for each entry.  The client only resolves the subsequent
   domain names if attempts to contact the first one failed or yielded
   no common transport protocols between the client and the controller
   or denote a domain that is administratively prohibited by client's
   policy.

   The use of multiple domain names is not meant to replace the SRV
   records, but rather to allow a single DHCP server to indicate the
   broadcast controllers in the wireless access provider's network.

   Clients MAY support compression according to the encoding in Section
   4.1.4 of "Domain Names - Implementation And Specification [RFC1035].
   Since the domain names are supposed to be different domains,
   compression will likely have little effect.  If the length of the
   domain list exceeds the maximum permissible length within a single
   option (254 octets), then the domain list MUST be represented in the
   DHCP message as specified in [RFC3396] .

   The DHCP option for this encoding has the following format:


           Code  Len   enc   FQDN(s) of Broadcast Controller
         +-----+-----+-----+-----+-----+-----+-----+-----+--
         | TBD |  n  |  0  |  s1 |  s2 |  s3 |  s4 | s5  |  ...
         +-----+-----+-----+-----+-----+-----+-----+-----+--


   An example case when two controller domain names e.g.
   bcmc1.example.com, bcmc2.example.com are returned will be:







Chowdhury, et al.       Expires November 17, 2005               [Page 6]

Internet-Draft                                                  May 2005


       +---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+
       |TBD|38 | 5 |'b'|'c'|'m'|'c'|'1'| 8 |'e'|'x'|'a'|'m'|'p'|'l'|'e'|
       +---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+
       +---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+
       | 3 |'c'|'o'|'m'| 5 |'b'|'c'|'m'|'c'|'2'| 8 |'e'|'x'|'a'|'m'|'p'|
       +---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+
       +---+---+---+---+---+---+---+---+
       |'l'|'e'|'1'| 3 |'c'|'o'|'m'|
       +---+---+---+---+---+---+---+



4.2  Broadcast Service Controller Domain Name List Option for DHCPv6

   The option length is followed by a sequence of labels, encoded
   according to Section 3.1 of RFC 1035.

   The option MAY contain multiple domain names, but these domain names
   SHOULD be used to construct SRV lookups as specified in [BCMCS],
   rather than querying for different A records.  The client MUST try
   the records in the order listed, applying the mechanism described in
   [BCMCS] for each entry.  The client only resolves the subsequent
   domain names if attempts to contact the first one failed or yielded
   no common transport protocols between the client and the controller
   or denote a domain administratively prohibited by client's policy.
   Use of multiple domain names is not meant to replace the SRV records,
   but rather to allow a single DHCPv6 server to indicate the broadcast
   controllers in the access provider's network.

   The DHCPv6 option for Boradcast Service Controller Domain Names has
   the format shown below.

   option-code: OPTION_BCMCS_SERVER_D (TBD).

   option-length: Length of the 'Broadcast Control Server Domain Name
   List' field in octets; variable.


      0                   1                   2                   3
      0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |      OPTION_BCMCS_SERVER_D    |         option-length         |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |          Broadcast Control Domain Name List                   |
     |                              ...                              |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+





Chowdhury, et al.       Expires November 17, 2005               [Page 7]

Internet-Draft                                                  May 2005


4.3  Broadcast Service Controller IPv4 address option

   The encoding byte (enc) is followed by a list of IPv4 addresses
   indicating broadcast controller IPv4 addresses.  The controllers MUST
   be listed in order of preference.  Its minimum length is 5, and the
   length MUST be a multiple of 4 plus one.  The DHCP option for this
   encoding has the following format:




          Code   Len   enc   Address 1               Address 2
         +-----+-----+-----+-----+-----+-----+-----+-----+--
         | TBD |  n  |  1  | a1  | a2  | a3  | a4  | a1  |  ...
         +-----+-----+-----+-----+-----+-----+-----+-----+--



4.4  Broadcast Service Controller IPv6 Address Option

   This DHCPv6 option MUST carry one or more 128-bit IPv6 address(es) of
   the Broadcast Service Controller in a operators network.

   option-code: OPTION_BCMCS_SERVER_A (TBD).

   option-length: Length of the 'Broadcast Control Server IPv6 address'
   field in octets; variable.


      0                   1                   2                   3
      0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |      OPTION_BCMCS_SERVER_A    |         option-length         |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |                                                               |
     |    Broadcast Control server-1 address (IPv6 address)          |
     |                                                               |
     |                                                               |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |                                                               |
     |    Broadcast Control server-2 address (IPv6 address)          |
     |                                                               |
     |                                                               |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |                              ...                              |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+





Chowdhury, et al.       Expires November 17, 2005               [Page 8]

Internet-Draft                                                  May 2005


4.5  Consideration for Client Operation

   For DHCPv6, a client MAY request either or both of the Broadcast
   Service Controller Domain Name List and the IPv6 Address options in
   the Options Request Option (ORO) as described in [RFC3315].

   If a client receives both the Broadcast Service Controller Domain
   Name List and IPv6 Address options, it SHOULD use the Domain Name
   List option.  In this case, the client MAY use the Broadcast Service
   Controller IPv6 Address option only if the servers in the Broadcast
   Service Controller Domain Name List can not be resolved or reached.

4.6  Consideration for Server Operation

   A server MAY send a client either the Broadcast Service Controller
   Domain Name List Option or the Broadcast Service Controller IPv6
   Address/IPv4 Address options if the server is configured to do so.

   In case of DHCPv6, If a client requests both options and the server
   is configured with both types of information, the server MAY send the
   client only one of these options if it is configured to do so.  In
   this case the server SHOULD send the Broadcast Service Controller
   Domain Name List option.

   A server configured with the Broadcast Service Controller IPv6
   Address information MUST send a client the Broadcast Service
   Controller IPv6 Address option if that client requested only the
   Broadcast Service Controller IPv6 address option and not the
   Broadcast Service Controller Domain Name List option in the ORO
   [RFC3315].

   If a client requests for the Broadcast Service Controller IPv6 option
   and the Server is configured only with the Domain Names, the Server
   MUST return the Domain Names List and vice versa.

   The following table summarizes the server's response for DHCPv6:


      Client sends in ORO     Domain Name List        IPv6 Address List
      __________________________________________________________________

      Neither option          SHOULD                  MAY
      Domain Name List        MUST                    MAY
      IPv6 Address            MAY                     MUST
      Both options            SHOULD                  MAY






Chowdhury, et al.       Expires November 17, 2005               [Page 9]

Internet-Draft                                                  May 2005


5.  Security Considerations

   The security considerations in the base DHCP spec [RFC2131] applies.
   An attacker may change information of the Broadcast Service
   Controller in packets that are in-tranist from DHCP server to the MN,
   if integrity protection is not in place.  In that event, the user of
   the Broadcast service may be diverted to a rogue broadcast service
   controller.  In the absence of a mutual authentication procedure
   between MN and the Broadcast controller, the MN may receive wrong or
   fraudulent information about Broadcast Service.









































Chowdhury, et al.       Expires November 17, 2005              [Page 10]

Internet-Draft                                                  May 2005


6.  IANA Considerations

   The following option codes for Broadcast Service Controller option
   must be assigned by IANA:

   1.  Broadcast Service Controller Domain Name list (section 4.1)

   2.  OPTION_BCMCS_SERVER_D (section 4.2)

   3.  Broadcast Service Controller IPv4 address option (section 4.3)

   4.  OPTION_BCMCS_SERVER_A (section 4.4)

   The DHCP options should be registered in
   http://www.iana.org/assignments/bootp-dhcp-extensions

   The DHCPv6 options should be registered in
   http://www.iana.org/assignments/dhcpv6-parameters

































Chowdhury, et al.       Expires November 17, 2005              [Page 11]

Internet-Draft                                                  May 2005


7.  Acknowledgements

   Thanks to the following indivduals for their review and constructive
   comments during the development of this document:

   AC Mahendran, Jun Wang, Raymond Hsu, Jayshree Bharatia, Ralph Droms,
   Ted Lemon, and Margaret Wasserman.

8.  Normative References

   [BCMCS]    3GPP2, www.3gpp2.org,
              ftp://ftp.3gpp2.org/TSGX/Projects/X.P0022 2ndV&V.zip,
              "X.S0022, Broadcast and Multicast Service in cdma2000
              Wireless IP Network. (work in progress)", December 2004.

   [RFC1035]  Mockapetris, P., "Domain names - implementation and
              specification", STD 13, RFC 1035, November 1987.

   [RFC2131]  Droms, R., "Dynamic Host Configuration Protocol",
              RFC 2131, March 1997.

   [RFC3315]  Droms, R., Bound, J., Volz, B., Lemon, T., Perkins, C.,
              and M. Carney, "Dynamic Host Configuration Protocol for
              IPv6 (DHCPv6)", RFC 3315, July 2003.

   [RFC3396]  Lemon, T. and S. Cheshire, "Encoding Long Options in the
              Dynamic Host Configuration Protocol (DHCPv4)", RFC 3396,
              November 2002.


Authors' Addresses

   Kuntal Chowdhury
   Starent Networks
   30 International Place
   Tewksbury, MA  01876
   US

   Phone: +1 214-550-1416
   Email: kchowdhury@starentnetworks.com











Chowdhury, et al.       Expires November 17, 2005              [Page 12]

Internet-Draft                                                  May 2005


   Parviz Yegani
   Cisco Systems
   3625 Cisco Way
   San Jose, CA  95134
   US

   Phone: +1 408-832-5729
   Email: pyegani@cisco.com


   Lila Madour
   Ericsson
   8400, Decarie Blvd
   Town of Mount Royal, Quebec  H4P 2N2
   CANADA

   Phone: +1 514-345-7900
   Email: Lila.Madour@ericsson.com

































Chowdhury, et al.       Expires November 17, 2005              [Page 13]

Internet-Draft                                                  May 2005


Intellectual Property Statement

   The IETF takes no position regarding the validity or scope of any
   Intellectual Property Rights or other rights that might be claimed to
   pertain to the implementation or use of the technology described in
   this document or the extent to which any license under such rights
   might or might not be available; nor does it represent that it has
   made any independent effort to identify any such rights.  Information
   on the procedures with respect to rights in RFC documents can be
   found in BCP 78 and BCP 79.

   Copies of IPR disclosures made to the IETF Secretariat and any
   assurances of licenses to be made available, or the result of an
   attempt made to obtain a general license or permission for the use of
   such proprietary rights by implementers or users of this
   specification can be obtained from the IETF on-line IPR repository at
   http://www.ietf.org/ipr.

   The IETF invites any interested party to bring to its attention any
   copyrights, patents or patent applications, or other proprietary
   rights that may cover technology that may be required to implement
   this standard.  Please address the information to the IETF at
   ietf-ipr@ietf.org.


Disclaimer of Validity

   This document and the information contained herein are provided on an
   "AS IS" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS
   OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET
   ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED,
   INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE
   INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED
   WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.


Copyright Statement

   Copyright (C) The Internet Society (2005).  This document is subject
   to the rights, licenses and restrictions contained in BCP 78, and
   except as set forth therein, the authors retain all their rights.


Acknowledgment

   Funding for the RFC Editor function is currently provided by the
   Internet Society.




Chowdhury, et al.       Expires November 17, 2005              [Page 14]

